<x-layout>
    <x-slot:title>
        blade - условия
    </x-slot:title>
    <h2>
        Условия в Blade в Laravel
    </h2>
    <div>
        <h3>
            Дерегива &#64;if в шаблонах Blade
        </h3>
        С помощью Blade директивы &#64;if можно задавать условия в представлениях. Давайте посмотрим на примере.
        <br />
        Пусть из действия в представление передается переменная, определяющая, авторизован пользователь или нет:
        <pre>
            return view('post.show', [
                'isAuth' => true
            ]);
            </pre>
        Покажем текст только для авторизованного пользователя:
        <pre>
            &#64;if ($isAuth)
                вы авторизованы
            &#64;endif
            </pre>
        А тепер покажем текст для неавторизованного пользователя:
        <pre>
            &#64;if (!$isAuth)
                вы не авторизованы
            &#64;endif
            </pre>
    </div>
    <a href="/blade/conditions/1">Задача 1</a>
    <div>
        <h3>
            Дерегива &#64;else в шаблонах Blade
        </h3>
        Следующий пример демонстрирует работу директивы &#64;else, работающий подобно своему PHP аналогу:
        <pre>
            &#64;if ($isAuth)
                вы авторизованы
            &#64;else
                вы не авторизованы
            &#64;endif
            </pre>
    </div>
    <a href="/blade/conditions/2">Задача 2</a>
    <div>
        <h3>
            Дерегива &#64;elseif в шаблонах Blade
        </h3>
        Следующий пример демонстрирует работу директивы &#64;elseif, работающий подобно своему PHP аналогу:
        <pre>
            &#64;if ($num > 0)
                больше нуля
            &#64;elseif($num === 0)
                ноль
            &#64;else
                меньше нуля
            &#64;endif
            </pre>
    </div>
    <a href="/blade/conditions/3">Задача 3</a>
    <div>
        <h3>
            Дерегива &#64;unless в шаблонах Blade
        </h3>
        Директива &#64;unless представляет собой команду <b>пока не</b> и не имеет аналога в PHP. Рассмотрим работу данной директивы на практическом примере.
        <br />
        Пусть в переменной $isAuth хранится пометка об авторизации пользователя. В том случае, если пользователь еще не авторизован, выведем ему сообщение об этом, пока используя директиву &#64;if:
        <pre>
            &#64;if (!$auth)
                вы еще не авторизованы
            &#64;endif
            </pre>
        Как вы видите, перед именем переменной нам приходится писать восклицательный знак, чтобы сделать отрицание.
        <br />
        Можно избавится от этого восклицательного знака, воспользовавшись директивой &#64;unless, которая сама по себе является отрицанием:
        <pre>
            &#64;unless ($isAuth)
                вы еще не авторизованы
            &#64;endunless
            </pre>
    </div>
    <a href="/blade/conditions/4">Задача 4</a>
    <div>
        <h3>
            Сложные команды в условиях Blade в Laravel
        </h3>
        В условиях можно давать более сложные команды. Пусть, например, в представление передается массив. Давайте подсчитаем количество элементов в этом массиве и, в зависимости от количества, выведем разный текст:
        <pre>
            &#64;if (count($arr) >= 1)
                в массиве есть записи
            &#64;else
                в массиве нет записей
            &#64;endif
            </pre>
    </div>
    <a href="/blade/conditions/5">Задача 5</a>

</x-layout>
