<x-layout>
    <x-slot:title>
        Связи в моделях Eloquent
    </x-slot:title>

    <h2>
        Связи в моделях Eloquent в Laravel
    </h2>
    <h3>
        Введение
    </h3>
    Сейчас мы разберем связывание моделей Eloquent. Суть связывания в следующем: если у нас есть несколько таблиц,
    связанных друг с другом, то при запросе к одной из таблиц, Laravel будет вытягивать соответствующие данные из
    другой.
    <br />
    Используя возможности фреймворка, получение связанных данных становится очень простым и удобным. Без сомнения,
    связывание моделей во фреймворках - одно из самых больших преимуществ, позволяющих упростить разработку.

</x-layout>
